#include <iostream>
using namespace std;

// 聲明 Variable 函數
void Variable();
// 聲明 Operators 函數
void Operators();

int main()
{
    Variable();
    Operators();
    return 0;
}
void Variable()
{
    // 整數型別================================================================
    int integerVar = 42;    // 整數變數
    short shortVar = 10;    // 短整數變數
    long longVar = 1000000; // 長整數變數

    // 浮點數型別==============================================================
    float floatVar = 3.14f;   // 單精度浮點數變數
    double doubleVar = 2.718; // 雙精度浮點數變數

    // 布林型別================================================================
    bool boolVar = true;

    // 字符型別================================================================
    char charVar = 'A';

    // 字串型別================================================================
    string strVar = "Hello, C++!";

    // 指標型別================================================================
    int *ptrVar = nullptr;
}
void Operators()
{
    // 算術運算符================================================================
    // + 加法
    // - 減法
    // * 乘法
    // / 除法
    // % 取餘數

    // 賦值運算符==============================================================
    // == 等於

    // 比較運算符================================================================
    // != 不等於
    // < 小於
    // > 大於
    // <= 小於等於
    // >= 大於等於

    // 邏輯運算符================================================================
    // && 且
    // || 或
    //  ! 非
}
